[
  {
    "file": "passwordformula.html",
    "title": "Passwords without Managers",
    "summary": "\n                Navigating the labyrinth of password creation can seem daunting. This guide provides a balanced\n                    approach, advocating the use of password formulas to generate unique, memorable, and secure\n                    passwords for every site you use. By concocting your own recipe, you can create a strong password\n                    that meets each site's requirements and keep it fresh with simple annual updates. It's a 'set and\n                    forget' method that replaces the need for sticky notes or repetitive passwords and offers a smart\n                    solution to modern password dilemmas.\n            ",
    "link": "blog\\passwordformula.html",
    "createdDate": "2023-06-20T06:00:00.000Z"
  },
  {
    "file": "arbitrage_bot.html",
    "title": "My First Crypto Arbitrage Bot",
    "summary": "\n                Documentation of my first attempt at a crypto arbitrage bot.\n            ",
    "link": "blog\\arbitrage_bot.html",
    "createdDate": "2023-04-22T06:00:00.000Z"
  },
  {
    "file": "solid_vote.html",
    "title": "Building the SolidVote Decentralized Voting Application",
    "summary": "\n                I discuss creating SolidVote, a decentralized voting app on Ethereum. The journey involved smart\n                    contracts, Truffle, Ganache, web3.js, Node.js, and Metamask integration, leading to a functional and\n                    secure voting application.\n            ",
    "link": "blog\\solid_vote.html",
    "createdDate": "2023-04-20T06:00:00.000Z"
  },
  {
    "file": "pantech.html",
    "title": "Welcome to the Pantech Phone Server",
    "summary": "\n\t\tMy experience setting up my first local server using Tiny Server. Outlines roadmap for learning web servers\n\t\t\tand programming, including my goal of pursuing Ethereum-based smart contract programming. The post also\n\t\t\tprovides instructions for setting up SSH access and authorized keys for passwordless login.\n\t",
    "link": "blog\\pantech.html",
    "createdDate": "2022-08-11T06:00:00.000Z"
  },
  {
    "file": "hpmini.html",
    "title": "My Journey Setting Up a LAMP Server on an HP Mini",
    "summary": "\n\t\tReviving my HP Mini with Lubuntu, I share my journey of setting up a LAMP server. Despite hardware\n\t\t\tlimitations and resolution challenges, I find solutions to wifi and video issues. Join me as I breathe new\n\t\t\tlife into this old machine for web server experimentation.\n\t",
    "link": "blog\\hpmini.html",
    "createdDate": "2022-08-03T06:00:00.000Z"
  }
]